app/views/categs/show.html.erb

<h2>Products</h2>
<% @categ.products.each do |product|%>
---
SELECT "products".* FROM "products" WHERE "products"."categ_id" = ?  [["categ_id", 1]]