app/controllers/categs_controller.rb

  def index
    @categs = Categ.all
---
SELECT "categs".* FROM "categs"

  def create
    @categ = Categ.new(categ_params)

    respond_to do |format|
      if @categ.save
---
INSERT INTO "categs" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Wearables"], ["created_at", "2023-08-09 06:20:32.790800"], ["updated_at", "2023-08-09 06:20:32.790800"]]

    def set_categ
      # byebug
      @categ = Categ.find(params[:id])
---
SELECT "categs".* FROM "categs" WHERE "categs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]