app/controllers/homes_controller.rb

SELECT "products".* FROM "products" WHERE (lower(name LIKE '%iphone%')
---
  def search
    if params[:search].blank?
      redirect_to homes_url and return
    else
      @parameter = params[:search].downcase
      @results = Product.all.where("lower(name) LIKE :search", search: "%#{@parameter}%")

INSERT INTO "homes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-08-04 07:30:35.502593"], ["updated_at", "2023-08-04 07:30:35.502593"]]
---
  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save

SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_home
      @home = Home.find(params[:id])