app/controllers/products_controller.rb

SELECT "categs".* FROM "categs" WHERE "categs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "products" ("name", "description", "price", "categ_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Iphone 11"], ["description", "128 GB"], ["price", "100000"], ["categ_id", 1], ["created_at", "2023-08-07 09:13:30.604301"], ["updated_at", "2023-08-07 09:13:30.604301"]]
---
  def create
    # byebug
    @categ = Categ.find(params[:categ_id])
    @product = @categ.products.create(product_params)

UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2023-08-09 10:52:38.630486"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)