app/controllers/shopkeeper_categories_controller.rb

  def index
    @shopkeeper_categories = ShopkeeperCategory.all
---
SELECT "shopkeeper_categories".* FROM "shopkeeper_categories"

    def set_shopkeeper_category
      @shopkeeper_category = ShopkeeperCategory.find(params[:id])
---
SELECT "shopkeeper_categories".* FROM "shopkeeper_categories" WHERE "shopkeeper_categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]